<a href="https://colab.research.google.com/github/dev-PrabhatShukla/Python-Libraries-For-Data-Science-Self-Notes/blob/main/Pandas_Operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Yesterday, we learnt a little about the very useful library Pandas widely used for Data Analysis. It is time to put the many utilities of this library in front of our eyes. We will be performing following manipulations and exploration of our data:**

* ### Indexing and slicing operations
* ### Manipulating columns
* ### Exploring unique and missing values

In [1]:
# Import pandas package
import pandas as pd
import numpy as np

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

## Let us read our data first

In [3]:
# loading csv File
file_path = '/content/drive/MyDrive/Colab Notebooks/AlmaBetter/Module 1 : Python for Data Science/Week 3/Pandas Operations/DataSet/phone_data.csv'
df=pd.read_csv(file_path)

In [4]:
df.shape

(830, 7)

In [5]:
df.head(10)

   index            date  duration  item    month    network network_type
0      0  15/10/14 06:58    34.429  data  2014-11       data         data
1      1  15/10/14 06:58    13.000  call  2014-11   Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11     Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11      Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11      Tesco       mobile
5      5  15/10/14 18:55     4.000  call  2014-11      Tesco       mobile
6      6  16/10/14 06:58    34.429  data  2014-11       data         data
7      7  16/10/14 15:01   602.000  call  2014-11      Three       mobile
8      8  16/10/14 15:12  1050.000  call  2014-11      Three       mobile
9      9  16/10/14 15:30    19.000  call  2014-11  voicemail    voicemail

In [6]:
df.tail(10)

     index            date  duration  item    month   network network_type
820    820  08/03/15 06:58    34.429  data  2015-03      data         data
821    821  09/03/15 06:58    34.429  data  2015-03      data         data
822    822  10/03/15 06:58    34.429  data  2015-03      data         data
823    823  11/03/15 06:58    34.429  data  2015-03      data         data
824    824  12/03/15 06:58    34.429  data  2015-03      data         data
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   index         830 non-null    int64
 1   date          830 non-null    object
 2   duration      830 non-null    float64
 3   item          830 non-null    object
 4   month         830 non-null    object
 5   network       830 non-null    object
 6   network_type  830 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 45.5+ KB

# <u>**<code>describe()</code>**</u>

## This method gives the overall descriptive summary of the dataframe. This works only for numerical columns

In [8]:
df.describe()

            index      duration
count  830.000000    830.000000
mean   414.500000    117.804036
std    239.744656    444.129560
min      0.000000      1.000000
25%    207.250000      1.000000
50%    414.500000     24.500000
75%    621.750000     55.000000
max    829.000000  10528.000000

# <u>**Indexing and Slicing**</u>

In [9]:
df.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

## **<code>iloc</code>** gets rows (or columns) at particular positions in the index (so it only takes integers).

In [10]:
# Let us get a subset which consists of first 8 rows and first 4 columns
df.iloc[:12,:4]

    index            date  duration  item
0       0  15/10/14 06:58    34.429  data
1       1  15/10/14 06:58    13.000  call
2       2  15/10/14 14:46    23.000  call
3       3  15/10/14 14:48     4.000  call
4       4  15/10/14 17:27     4.000  call
5       5  15/10/14 18:55     4.000  call
6       6  16/10/14 06:58    34.429  data
7       7  16/10/14 15:01   602.000  call
8       8  16/10/14 15:12  1050.000  call
9       9  16/10/14 15:30    19.000  call
10     10  16/10/14 16:21  1183.000  call
11     11  16/10/14 22:18     1.000   sms

## **<code>loc</code>** gets rows (or columns) with particular labels from the index.

In [11]:
# Now let us subset our dataframe in which we want to have first 8 rows identified with their rows labels and some named columns
df.loc[:50,['month','network','duration', 'network_type']]

      month    network  duration network_type
0   2014-11       data    34.429         data
1   2014-11   Vodafone    13.000       mobile
2   2014-11     Meteor    23.000       mobile
3   2014-11      Tesco     4.000       mobile
4   2014-11      Tesco     4.000       mobile
5   2014-11      Tesco     4.000       mobile
6   2014-11       data    34.429         data
7   2014-11      Three   602.000       mobile
8   2014-11      Three  1050.000       mobile
9   2014-11  voicemail    19.000    voicemail
10  2014-11      Three  1183.000       mobile
11  2014-11     Meteor     1.000       mobile
12  2014-11     Meteor     1.000       mobile
13  2014-11       data    34.429         data
14  2014-11      Tesco     1.000       mobile
15  2014-11      Tesco     1.000       mobile
16  2014-11     Meteor     1.000       mobile
17  2014-11   Vodafone     1.000       mobile
18  2014-11   Vodafone     1.000       mobile
19  2014-11      Three    92.000       mobile
20  2014-11   Vodafone     4.000       mobile
21  2014-11      Tesco   375.000       mobile
22  2014-11   Vodafone     1.000       mobile
23  2014-11   Vodafone     1.000       mobile
24  2014-11   Vodafone     1.000       mobile
25  2014-11   Vodafone     1.000       mobile
26  2014-11       data    34.429         data
27  2014-11      Tesco   783.000       mobile
28  2014-11   Vodafone     4.000       mobile
29  2014-11   Vodafone     3.000       mobile
30  2014-11   Vodafone   101.000       mobile
31  2014-11      Three  1714.000       mobile
32  2014-11  voicemail    96.000    voicemail
33  2014-11   Vodafone     1.000       mobile
34  2014-11      Three   384.000       mobile
35  2014-11      Three     4.000       mobile
36  2014-11      Three     1.000       mobile
37  2014-11   Vodafone     1.000       mobile
38  2014-11      Three     1.000       mobile
39  2014-11       data    34.429         data
40  2014-11      Three    53.000       mobile
41  2014-11      Tesco    86.000       mobile
42  2014-11      Three    23.000       mobile
43  2014-11      Three    38.000       mobile
44  2014-11      Three   428.000       mobile
45  2014-11       data    34.429         data
46  2014-11  voicemail    69.000    voicemail
47  2014-11  voicemail    18.000    voicemail
48  2014-11   Vodafone     3.000       mobile
49  2014-11   landline     6.000     landline
50  2014-11      Tesco     5.000       mobile

In [12]:
df.loc[:,['month','network','duration']]

       month   network  duration
0    2014-11      data    34.429
1    2014-11  Vodafone    13.000
2    2014-11    Meteor    23.000
3    2014-11     Tesco     4.000
4    2014-11     Tesco     4.000
..       ...       ...       ...
825  2015-03     world     1.000
826  2015-03  Vodafone     1.000
827  2015-03      data    34.429
828  2015-03     world     1.000
829  2015-03     world     1.000

[830 rows x 3 columns]

In [13]:
df[0:10]

   index            date  duration  item    month    network network_type
0      0  15/10/14 06:58    34.429  data  2014-11       data         data
1      1  15/10/14 06:58    13.000  call  2014-11   Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11     Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11      Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11      Tesco       mobile
5      5  15/10/14 18:55     4.000  call  2014-11      Tesco       mobile
6      6  16/10/14 06:58    34.429  data  2014-11       data         data
7      7  16/10/14 15:01   602.000  call  2014-11      Three       mobile
8      8  16/10/14 15:12  1050.000  call  2014-11      Three       mobile
9      9  16/10/14 15:30    19.000  call  2014-11  voicemail    voicemail

In [14]:
df[['duration','item','network_type']][:10]

   duration  item network_type
0    34.429  data         data
1    13.000  call       mobile
2    23.000  call       mobile
3     4.000  call       mobile
4     4.000  call       mobile
5     4.000  call       mobile
6    34.429  data         data
7   602.000  call       mobile
8  1050.000  call       mobile
9    19.000  call    voicemail

In [15]:
list(df.columns)

['index', 'date', 'duration', 'item', 'month', 'network', 'network_type']

## <b>In fact we can also perform boolean indexing on our dataframe</b>

In [ ]:
df['network_type'] == 'mobile'

0      False
1       True
2       True
3       True
4       True
       ...
825    False
826     True
827    False
828    False
829    False
Name: network_type, Length: 830, dtype: bool

In [16]:
# Boolean Indexing
vodafone_network = df[df['network'] == 'Vodafone']
vodafone_network.head()

    index            date  duration  item    month   network network_type
1       1  15/10/14 06:58      13.0  call  2014-11  Vodafone       mobile
17     17  17/10/14 17:22       1.0   sms  2014-11  Vodafone       mobile
18     18  17/10/14 17:23       1.0   sms  2014-11  Vodafone       mobile
20     20  17/10/14 17:29       4.0  call  2014-11  Vodafone       mobile
22     22  17/10/14 17:42       1.0   sms  2014-11  Vodafone       mobile

In [17]:
vodafone_network.shape

(215, 7)

In [ ]:
talk_duration = df[df['duration'] > 4.0]
talk_duration.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
6      6  16/10/14 06:58    34.429  data  2014-11      data         data
7      7  16/10/14 15:01   602.000  call  2014-11     Three       mobile

## Infact we can match conditions for mutliple columns

In [18]:
talk_duration = df[df['duration'] > 4.0]

In [ ]:
talk_duration.tail()

     index            date  duration  item    month network network_type
821    821  09/03/15 06:58    34.429  data  2015-03    data         data
822    822  10/03/15 06:58    34.429  data  2015-03    data         data
823    823  11/03/15 06:58    34.429  data  2015-03    data         data
824    824  12/03/15 06:58    34.429  data  2015-03    data         data
827    827  13/03/15 06:58    34.429  data  2015-03    data         data

In [19]:
long_duration = df[(df['duration']>4.0) & (df['network'] == 'Vodafone')]
long_duration.head()

    index            date  duration  item    month   network network_type
1       1  15/10/14 06:58      13.0  call  2014-11  Vodafone       mobile
30     30  18/10/14 13:08     101.0  call  2014-11  Vodafone       mobile
51     51  20/10/14 18:24     131.0  call  2014-11  Vodafone       mobile
64     64  23/10/14 11:25      24.0  call  2014-11  Vodafone       mobile
96     96  29/10/14 12:56     442.0  call  2014-11  Vodafone       mobile

# <u>**Next let us see how we can manipulate columns**</u>

In [20]:
df.shape

(830, 7)

## **Let's say if you wanted a new column whose values were half the calling duration**

In [21]:
df['duration']

0      34.429
1      13.000
2      23.000
3       4.000
4       4.000
        ...
825     1.000
826     1.000
827    34.429
828     1.000
829     1.000
Name: duration, Length: 830, dtype: float64

In [22]:
# Add new column which is just half the runtime
df['half_call_duration'] = df['duration'] * 0.5

In [ ]:
df.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

## We can also create a new column by adding two existing columns

In [23]:
# Creating another new column by subtracting/adding two existing columns
df['duration_difference'] = df['duration'] - df['half_call_duration']

In [ ]:
df.head()

   index            date  ...  half_call_duration duration_difference
0      0  15/10/14 06:58  ...             17.2145             17.2145
1      1  15/10/14 06:58  ...              6.5000              6.5000
2      2  15/10/14 14:46  ...             11.5000             11.5000
3      3  15/10/14 14:48  ...              2.0000              2.0000
4      4  15/10/14 17:27  ...              2.0000              2.0000

[5 rows x 9 columns]

## **Next, we can also drop some columns which we want to drop**

In [24]:
# Remove column
df.drop(['item'], axis = 1, inplace=True)

In [ ]:
df.head()

   index            date  ...  half_call_duration duration_difference
0      0  15/10/14 06:58  ...             17.2145             17.2145
1      1  15/10/14 06:58  ...              6.5000              6.5000
2      2  15/10/14 14:46  ...             11.5000             11.5000
3      3  15/10/14 14:48  ...              2.0000              2.0000
4      4  15/10/14 17:27  ...              2.0000              2.0000

[5 rows x 8 columns]

In [25]:
df.describe()

            index      duration  half_call_duration  duration_difference
count  830.000000    830.000000          830.000000           830.000000
mean   414.500000    117.804036           58.902018            58.902018
std    239.744656    444.129560          222.064780           222.064780
min      0.000000      1.000000            0.500000             0.500000
25%    207.250000      1.000000            0.500000             0.500000
50%    414.500000     24.500000           12.250000            12.250000
75%    621.750000     55.000000           27.500000            27.500000
max    829.000000  10528.000000         5264.000000          5264.000000

## You can drop  multiple columns at once too.

In [26]:
df.drop(['half_call_duration','duration_difference'],axis=1,inplace=True)

In [ ]:
df.head()

   index            date  duration    month   network network_type
0      0  15/10/14 06:58    34.429  2014-11      data         data
1      1  15/10/14 06:58    13.000  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  2014-11     Tesco       mobile

## **We can do a lot of basic operations as well**

In [27]:
# Find the sum of values in a column
df['duration'].sum()

97777.35000000002

In [28]:
# What if there is a null value
df.loc[:2,'duration'] = np.nan

In [29]:
df.iloc[:5]

   index            date  duration    month   network network_type
0      0  15/10/14 06:58       NaN  2014-11      data         data
1      1  15/10/14 06:58       NaN  2014-11  Vodafone       mobile
2      2  15/10/14 14:46       NaN  2014-11    Meteor       mobile
3      3  15/10/14 14:48       4.0  2014-11     Tesco       mobile
4      4  15/10/14 17:27       4.0  2014-11     Tesco       mobile

In [31]:
df.set_index('network', inplace=True)

In [30]:
df.head()

   index            date  duration    month   network network_type
0      0  15/10/14 06:58       NaN  2014-11      data         data
1      1  15/10/14 06:58       NaN  2014-11  Vodafone       mobile
2      2  15/10/14 14:46       NaN  2014-11    Meteor       mobile
3      3  15/10/14 14:48       4.0  2014-11     Tesco       mobile
4      4  15/10/14 17:27       4.0  2014-11     Tesco       mobile

In [32]:
df.iloc[:3]

          index            date  duration    month network_type
network
data          0  15/10/14 06:58       NaN  2014-11         data
Vodafone      1  15/10/14 06:58       NaN  2014-11       mobile
Meteor        2  15/10/14 14:46       NaN  2014-11       mobile

In [33]:
df.loc[['data','Meteor']]

         index            date  duration    month network_type
network
data         0  15/10/14 06:58       NaN  2014-11         data
data         6  16/10/14 06:58    34.429  2014-11         data
data        13  17/10/14 06:58    34.429  2014-11         data
data        26  18/10/14 06:58    34.429  2014-11         data
data        39  19/10/14 06:58    34.429  2014-11         data
...        ...             ...       ...      ...          ...
Meteor     722  09/02/15 22:54     1.000  2015-02       mobile
Meteor     741  17/02/15 15:59    24.000  2015-03       mobile
Meteor     781  28/02/15 14:57    49.000  2015-03       mobile
Meteor     792  01/03/15 12:19     9.000  2015-03       mobile
Meteor     802  02/03/15 17:35   192.000  2015-03       mobile

[237 rows x 5 columns]

In [34]:
df.head()

          index            date  duration    month network_type
network
data          0  15/10/14 06:58       NaN  2014-11         data
Vodafone      1  15/10/14 06:58       NaN  2014-11       mobile
Meteor        2  15/10/14 14:46       NaN  2014-11       mobile
Tesco         3  15/10/14 14:48       4.0  2014-11       mobile
Tesco         4  15/10/14 17:27       4.0  2014-11       mobile

#Print Longest And Shortest Calling Duration using "f" String.

In [35]:
print(f"The Longest calling duration {df['duration'].max()}")
print(f"The shortest calling duration {df['duration'].min()}")

The Longest calling duration 10528.0
The shortest calling duration 1.0

# **<code>apply()</code>** method applies a function to every row in a pandas dataframe

In [36]:
# Suppose we want to convert the column network to uppercase

def to_uppercase(column):
  return column.upper()

In [37]:
df['Capitalized_network_type'] = df['network_type'].apply(to_uppercase)

In [46]:
df.head()

          index            date  ...  half_call_duration new_call_duration
network                          ...
data          0  15/10/14 06:58  ...                 NaN               NaN
Vodafone      1  15/10/14 06:58  ...                 NaN               NaN
Meteor        2  15/10/14 14:46  ...                 NaN               NaN
Tesco         3  15/10/14 14:48  ...                 2.0               2.0
Tesco         4  15/10/14 17:27  ...                 2.0               2.0

[5 rows x 8 columns]

## Another way to use <code>apply()</code> involves the use of <code>lambda()</code> function.

* ### A <code>lambda()</code> function is a small anonymous function.
* ### A <code>lambda()</code> function can take any number of arguments, but can only have one expression.

In [38]:
def add_two_numbers(a,b):
  return a+b

In [39]:
x = lambda a,b : a+b
x(1,5)

6

In [40]:
df['half_call_duration'] = df['duration'] * 0.5
df.head()

          index            date  ...  Capitalized_network_type half_call_duration
network                          ...
data          0  15/10/14 06:58  ...                      DATA                NaN
Vodafone      1  15/10/14 06:58  ...                    MOBILE                NaN
Meteor        2  15/10/14 14:46  ...                    MOBILE                NaN
Tesco         3  15/10/14 14:48  ...                    MOBILE                2.0
Tesco         4  15/10/14 17:27  ...                    MOBILE                2.0

[5 rows x 7 columns]

In [41]:
def revised_calling_duration(duration, half_call_duration):
  if duration > 0:
    new_call_duration = duration - half_call_duration
  else:
    new_call_duration = np.nan

  return new_call_duration

In [42]:
df['new_call_duration'] = df.apply(lambda x: revised_calling_duration(x['duration'], x['half_call_duration']), axis=1)

In [43]:
df.head()

          index            date  ...  half_call_duration new_call_duration
network                          ...
data          0  15/10/14 06:58  ...                 NaN               NaN
Vodafone      1  15/10/14 06:58  ...                 NaN               NaN
Meteor        2  15/10/14 14:46  ...                 NaN               NaN
Tesco         3  15/10/14 14:48  ...                 2.0               2.0
Tesco         4  15/10/14 17:27  ...                 2.0               2.0

[5 rows x 8 columns]

## We can also sort our dataframe by some column values in either an ascending or descending order

In [44]:
# Sort values in descending order
df.sort_values('duration', ascending=False)

          index            date  ...  half_call_duration new_call_duration
network                          ...
landline    816  04/03/15 12:29  ...              5264.0            5264.0
Three       742  17/02/15 19:09  ...              1164.0            1164.0
Three       252  19/11/14 18:56  ...              1060.0            1060.0
landline     59  23/10/14 08:34  ...               970.0             970.0
Three       648  25/01/15 16:55  ...               931.5             931.5
...         ...             ...  ...                 ...               ...
Vodafone    604  16/01/15 18:07  ...                 0.5               0.5
world       829  14/03/15 00:16  ...                 0.5               0.5
data          0  15/10/14 06:58  ...                 NaN               NaN
Vodafone      1  15/10/14 06:58  ...                 NaN               NaN
Meteor        2  15/10/14 14:46  ...                 NaN               NaN

[830 rows x 8 columns]

In [48]:
# We can also sort by the combination of two columns
df.sort_values(['duration','month'], ascending=[False,True]).head()

          index            date  ...  half_call_duration new_call_duration
network                          ...
landline    816  04/03/15 12:29  ...              5264.0            5264.0
Three       742  17/02/15 19:09  ...              1164.0            1164.0
Three       252  19/11/14 18:56  ...              1060.0            1060.0
landline     59  23/10/14 08:34  ...               970.0             970.0
Three       648  25/01/15 16:55  ...               931.5             931.5

[5 rows x 8 columns]

# <b>Let us explore some datetime operations and functions

Directive

* #### <b>%a</b>	Weekday as locale’s abbreviated name.	Sun, Mon, …, Sat (en_US)
So, Mo, …, Sa (de_DE)
* #### <b>%A</b>	Weekday as locale’s full name.	Sunday, Monday, …, Saturday (en_US)
Sonntag, Montag, …, Samstag (de_DE)
* #### <b>%w</b>	Weekday as a decimal number, where 0 is Sunday and 6 is Saturday.	0, 1, 2, 3, 4, 5, 6
* #### <b>%d</b>	Day of the month as a zero-padded decimal number.	01, 02, …, 31
* #### <b>%b</b>	Month as locale’s abbreviated name.	Jan, Feb, …, Dec (en_US)
Jan, Feb, …, Dez (de_DE)
* #### <b>%B</b>	Month as locale’s full name.	January, February, …, December (en_US)
Januar, Februar, …, Dezember (de_DE)
* #### <b>%m</b>	Month as a zero-padded decimal number.	01, 02 … 12
* #### <b>%y</b>	Year without century as a zero-padded decimal number.	01, 02, … 99
* #### <b>%Y</b>	Year with century as a decimal number.	0001, 0002, … , 9999
* #### <b>%H</b>	Hour (24-hour clock) as a zero-padded decimal number.	01, 02, … , 23
* #### <b>%I</b>	Hour (12-hour clock) as a zero-padded decimal number.	01, 02, … , 12
* #### <b>%p</b>	Locale’s equivalent of either AM or PM.	AM, PM (en_US)
am, pm (de_DE)
* #### <b>%M</b>	Minute as a zero-padded decimal number.	01, 02, … , 59
* #### <b>%S</b>	Second as a zero-padded decimal number.	01, 02, … , 59
* #### <b>%f</b>	Microsecond as a decimal number, zero-padded on the left.	000000, 000001, …, 999999

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 830 entries, data to world
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   index                     830 non-null    int64
 1   date                      830 non-null    object
 2   duration                  827 non-null    float64
 3   month                     830 non-null    object
 4   network_type              830 non-null    object
 5   Capitalized_network_type  830 non-null    object
 6   half_call_duration        827 non-null    float64
 7   new_call_duration         827 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 78.4+ KB

In [51]:
# Importing datetime modules
from datetime import datetime
from datetime import date

## <code>strptime</code> means string parser, this will convert a string format to datetime. 

## <code>strftime</code> means string formatter, this will format a datetime object to string format.

In [52]:
df['date'][0:5]

network
data        15/10/14 06:58
Vodafone    15/10/14 06:58
Meteor      15/10/14 14:46
Tesco       15/10/14 14:48
Tesco       15/10/14 17:27
Name: date, dtype: object

In [ ]:
df['new_date']=df['date'].apply(lambda x : datetime.strptime(x,'%m/%d/%y'))

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 830 entries, data to world
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   index                     830 non-null    int64
 1   date                      830 non-null    object
 2   duration                  827 non-null    float64
 3   month                     830 non-null    object
 4   network_type              830 non-null    object
 5   Capitalized_network_type  830 non-null    object
 6   half_call_duration        827 non-null    float64
 7   new_call_duration         827 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 78.4+ KB

In [ ]:
df.head()

           id  ... new_release_date
imdb_id        ...
tt2637294   1  ...       2015-02-20
tt0368933   2  ...       2004-08-06
tt2582802   3  ...       2014-10-10
tt1821480   4  ...       2012-03-09
tt1380152   5  ...       2009-02-05

[5 rows x 24 columns]

In [ ]:
df['new_release_date'][0]

Timestamp('2015-02-20 00:00:00')

In [ ]:
# Month year date
print(df['new_release_date'][0].month)
print(df['new_release_date'][0].year)
print(df['new_release_date'][0].day)
print(df['new_release_date'][0].hour)
print(df['new_release_date'][0].minute)

2
2015
20
0
0

In [ ]:
print(date.today())
print(datetime.now())

2021-02-17
2021-02-17 16:19:20.428727

In [ ]:
datetime.now() + 1

TypeError: ignored

In [56]:
# Some operations we can do on datetime 
from datetime import timedelta
print(date.today())
print(date.today() - timedelta(days=1))
print(datetime.now() + timedelta(hours=5.5))
print(datetime.now() + timedelta(seconds=60))

2021-09-25
2021-09-24
2021-09-25 12:40:20.828691
2021-09-25 07:11:20.828791

In [ ]:
print(df['new_release_date'][0])
print(df['new_release_date'][5])

In [ ]:
# Difference in two datetime
time_delta=df['new_release_date'][0]-df['new_release_date'][5]
time_delta

In [59]:
type(time_delta)

NameError: ignored

In [58]:
time_delta.total_seconds()

NameError: ignored

In [61]:
t1 = pd.to_datetime('1/1/2015 01:00')
t2 = pd.to_datetime('1/1/2015 03:30')

print(pd.Timedelta(t2 - t1).seconds / 3600.0)

2.5

# **Let's explore the unique and missing values**

* ### <code>unique()</code>
* ### <code>nunique()</code>
* ### <code>value_counts()</code>
* ### <code>isnull()</code>
* ### <code>fillna()</code>

In [62]:
df

          index            date  ...  half_call_duration new_call_duration
network                          ...
data          0  15/10/14 06:58  ...                 NaN               NaN
Vodafone      1  15/10/14 06:58  ...                 NaN               NaN
Meteor        2  15/10/14 14:46  ...                 NaN               NaN
Tesco         3  15/10/14 14:48  ...              2.0000            2.0000
Tesco         4  15/10/14 17:27  ...              2.0000            2.0000
...         ...             ...  ...                 ...               ...
world       825  13/03/15 00:38  ...              0.5000            0.5000
Vodafone    826  13/03/15 00:39  ...              0.5000            0.5000
data        827  13/03/15 06:58  ...             17.2145           17.2145
world       828  14/03/15 00:13  ...              0.5000            0.5000
world       829  14/03/15 00:16  ...              0.5000            0.5000

[830 rows x 8 columns]

In [63]:
# Find the list of unique values in a column
list(df['network_type'].unique())

['data', 'mobile', 'voicemail', 'landline', 'special', 'world']

In [64]:
# Counts the number of unique values in a column
df.network_type.nunique()

6

In [65]:
# Give the counts of each category of a variable
df['network_type'].value_counts()

mobile       601
data         150
landline      42
voicemail     27
world          7
special        3
Name: network_type, dtype: int64

In [ ]:
# Does not make much sense to use value_counts for a numeric variable
df.runtime.value_counts()

90.0     100
100.0     99
105.0     91
95.0      89
98.0      85
        ...
11.0       1
62.0       1
66.0       1
248.0      1
177.0      1
Name: runtime, Length: 139, dtype: int64

In [68]:
# Returns a series of booleans if a column value contains nulls
df['duration'].isnull()

network
data         True
Vodafone     True
Meteor       True
Tesco       False
Tesco       False
            ...
world       False
Vodafone    False
data        False
world       False
world       False
Name: duration, Length: 830, dtype: bool

In [67]:
df[~df['duration'].isnull()]

          index            date  ...  half_call_duration new_call_duration
network                          ...
Tesco         3  15/10/14 14:48  ...              2.0000            2.0000
Tesco         4  15/10/14 17:27  ...              2.0000            2.0000
Tesco         5  15/10/14 18:55  ...              2.0000            2.0000
data          6  16/10/14 06:58  ...             17.2145           17.2145
Three         7  16/10/14 15:01  ...            301.0000          301.0000
...         ...             ...  ...                 ...               ...
world       825  13/03/15 00:38  ...              0.5000            0.5000
Vodafone    826  13/03/15 00:39  ...              0.5000            0.5000
data        827  13/03/15 06:58  ...             17.2145           17.2145
world       828  14/03/15 00:13  ...              0.5000            0.5000
world       829  14/03/15 00:16  ...              0.5000            0.5000

[827 rows x 8 columns]

In [76]:
# Lets fill the missing values with the value -999
df['duration'].fillna('Not Present',inplace = True)

In [77]:
df.head()

          index            date  ... half_call_duration new_call_duration
network                          ...
data          0  15/10/14 06:58  ...                NaN               NaN
Vodafone      1  15/10/14 06:58  ...                NaN               NaN
Meteor        2  15/10/14 14:46  ...                NaN               NaN
Tesco         3  15/10/14 14:48  ...                2.0               2.0
Tesco         4  15/10/14 17:27  ...                2.0               2.0

[5 rows x 8 columns]